In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])

In [3]:
ser1

a    0
b    1
c    2
dtype: int32

In [5]:
ser1.drop('a')

b    1
c    2
dtype: int32

In [6]:
df1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])

In [7]:
df1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

drop column

In [9]:
df1.drop('pop',axis=1)

    size  year
SF     1     2
LA     4     5
NY     7     8

drop row

In [10]:
df1.drop('SF')

    pop  size  year
LA    3     4     5
NY    6     7     8